case_up_half_cube_27/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 2.76e-06;

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            inletOutlet;
        inletValue      uniform 2.76e-06;
        value           uniform 2.76e-06;
    }
    top
    {
        type            inletOutlet;
        inletValue      uniform 2.76e-06;
        value           uniform 2.76e-06;
    }
    bottom
    {
        type            epsilonWallFunction;
        value           uniform 2.76e-06;
    }
    front
    {
        type            symmetryPlane;
    }
    back
    {
        type            inletOutlet;
        inletValue      uniform 2.76e-06;
        value           uniform 2.76e-06;
    }
    walls
    {
        type            epsilonWallFunction;
        value           uniform 2.76e-06;
    }
    source
    {
        // Auto-scales with instantaneous k — consistent with U/k ramp.
        // ε = Cμ^(3/4)*k^(3/2)/L, Cμ=0.09, L=2.0e-3 m (25.3 mm notional nozzle).
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    2.0e-3;
        value           uniform 2.76e-06;
    }
    nozzle_wall_rest
    {
        type            epsilonWallFunction;
        value           uniform 2.76e-06;
    }
}


// ************************************************************************* //
